Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/food_safety/safefood.html.txt.tmx
Source language: en
Languages: ga

source: Safefood - the Food Safety Promotion Board
ga: Biaslán - An Bord um Chur Chun Cinn na Sábháilteachta Bia

source: Safefood (the Food Safety Promotion Board), is one of a number of North/South bodies set up in Ireland as a result of the Good Friday Agreement
ga: Tá Biaslán (An Bord um Chur Chun Cinn na Sábháilteachta Bia), ar cheann de na comhlachtaí Thuaidh/Theas a bunaíodh in Éirinn mar thoradh ar Chomhaontú Aoine an Chéasta

source: The organisation was set up to promote awareness and knowledge of food safety and nutrition issues on the island of Ireland
ga: Bunaíodh an eagraíocht chun feasacht agus eolas a chur chun cinn ar shábháilteacht bhia agus ar shaincheisteanna cothaithe ar oileán na hÉireann

source: Safefood is based in Ireland, but conducts its work on an all-island basis
ga: Tá Biaslán bunaithe in Éirinn, agus déanann sé a chuid oibre ar bhunús uile-oileáin

source: This organisation reports to the North South Ministerial Council (NSMC)
ga: Tá an eagraíocht freagrach don Chomhairle Aireachta Thuaidh/Theas

source: What does Safefood do?
ga: Cad a dhéanann Biaslán?

source: Safefood aims to to create an environment where consumers everywhere in Ireland can have confidence in the food they eat
ga: Tá sé d’aidhm ag Biaslán timpeallacht a chruthú inar féidir le tomhaltóirí i ngach áit in Éirinn muinín a bheith acu as an mbia a itheann siad

source: They provide advice and guidance to the food industry and to consumers
ga: Cuireann siad comhairle agus treoir ar fáil don tionscal bia agus do thomhaltóirí
